<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // 数据库类型
    'type'            => 'sqlsrv',
    // 服务器地址
   'hostname'        => '172.16.79.189',
    // 数据库名
   'database'        => 'master',
  //  // 用户名
    'username'        => 'lgy',
    // 密码
    'password'        => '123abcABC',
    // 端口
    'hostport'        => '1433',
    // 连接dsn
    //'dsn'             => 'sqlsrv://172.16.65.149,1052/JWBSERVER2005;;',
    // 数据库连接参数
    'params'          => [],
    // 数据库编码默认采用utf8
    'charset'         => 'GBK',

];
